
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>适合自己的才是最好的 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <script type="text/javascript">
        if (location.protocol !== 'https:') {
            location.href = 'https:' + window.location.href.substring(window.location.protocol.length);
        }
        </script>
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" type="image/png" href="/resources/favicon-152.png">
    <link rel="apple-touch-icon-precomposed" sizes="180x180" type="image/png" href="/resources/favicon-180.png">
    <link rel="icon" type="image/png" href="/resources/favicon-192.png">
    <link rel="shortcut icon" href="/resources/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="speed.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" >
            
                <a target="_blank" href="https://www.v2ray.com/">
            
                    
                    官方网站
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    官方博客
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../2016/one-year.html">
            
                <a href="../2016/one-year.html">
            
                    
                    一周年记
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="speed.html">
            
                <a href="speed.html">
            
                    
                    传说中的性能测试
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.3" data-path="design.html">
            
                <a href="design.html">
            
                    
                    适合自己的才是最好的
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >适合自己的才是最好的</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;">&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;</h1>
<p>&#x6700;&#x8FD1;&#x6709;&#x5F88;&#x591A;&#x5173;&#x4E8E; Shadowsocks &#x5B89;&#x5168;&#x6027;&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x6BD4;&#x5982;<a href="https://blog.zhuhaow.me/security/ss/2017/04/07/the-security-myth-of-some-network-tools/" target="_blank">&#x8FD9;&#x4E2A;</a>&#x548C;<a href="https://medium.com/@Blankwonder/%E5%90%84%E7%A7%8D%E5%8A%A0%E5%AF%86%E4%BB%A3%E7%90%86%E5%8D%8F%E8%AE%AE%E7%9A%84%E7%AE%80%E5%8D%95%E5%AF%B9%E6%AF%94-1ed52bf7a803" target="_blank">&#x8FD9;&#x4E2A;</a>&#xFF0C;&#x8FD8;&#x6709;<a href="https://github.com/shadowsocks/shadowsocks-org/issues/64" target="_blank">&#x8FD9;&#x4E2A;</a>&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8BA8;&#x8BBA;&#x7684;&#x8303;&#x56F4;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E; Shadowsocks&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#x5B83;&#x662F;&#x76EE;&#x524D;&#x6700;&#x6D41;&#x884C;&#x7684;&#x7FFB;&#x5899;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x662F;&#x6700;&#x5927;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x7C7B;&#x7684;&#x8BA8;&#x8BBA;&#x4E0D;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x660E;&#x786E;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x8C01;&#x90FD;&#x8BF4;&#x670D;&#x4E0D;&#x4E86;&#x8C01;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5927;&#x5BB6;&#x8868;&#x8FBE;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x548C;&#x9700;&#x6C42;&#xFF0C;&#x8BA9;&#x65C1;&#x4EBA;&#x4E5F;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x7FFB;&#x5899;&#x4E2D;&#x53EF;&#x80FD;&#x78B0;&#x5230;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x6211;&#x4E5F;&#x6765;&#x51D1;&#x4E2A;&#x70ED;&#x95F9;&#xFF0C;&#x8BF4;&#x8BF4; V2Ray &#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;V2Ray &#x662F;&#x4EC0;&#x4E48;&#xFF1F;V2Ray &#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4EE3;&#x7406;&#x5DE5;&#x5177;&#x3002;&#x4EC0;&#x4E48;&#x662F;&#x4EE3;&#x7406;&#xFF1F;&#x4EE3;&#x7406;&#x662F;&#x5F53; A &#x548C; B &#x60F3;&#x8BF4;&#x8BDD;&#x4F46;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5BF9;&#x8BDD;&#x65F6;&#xFF0C;&#x8981;&#x627E; C &#x6765;&#x4F20;&#x8BDD;&#xFF0C;&#x8FD9;&#x65F6; C &#x5C31;&#x662F;&#x4EE3;&#x7406;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;C &#x6709;&#x54EA;&#x4E9B;&#x804C;&#x8D23;&#xFF1F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x628A;&#x8BDD;&#x4F20;&#x5230;&#xFF0C;&#x628A;&#x8BDD;&#x4F20;&#x5BF9;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x6CC4;&#x9732;&#x7ED9;&#x9664; A&#x3001;B &#x4E4B;&#x5916;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x770B;&#x4F3C;&#x8FD9;&#x4E2A;&#x63CF;&#x8FF0;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x628A;&#x5B83;&#x5E94;&#x7528;&#x5230;&#x4EE3;&#x7406;&#x8F6F;&#x4EF6;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8868;&#x8FF0;&#x4E3A;&#x4E0B;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<ul>
<li>&#x5F00;&#x653E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x4F7F;&#x5F97; A &#x548C; B &#x53EF;&#x4EE5;&#x95F4;&#x63A5;&#x5730;&#x8FDB;&#x884C;&#x6B63;&#x5E38;&#x901A;&#x4FE1;&#xFF1B;</li>
<li>&#x901A;&#x4FE1;&#x5185;&#x5BB9;&#x4E0D;&#x80FD;&#x88AB;&#x7B2C;&#x4E09;&#x65B9;&#x77E5;&#x6653;&#xFF1B;</li>
<li>&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x8981;&#x7A33;&#x5B9A;&#xFF0C;&#x4E0D;&#x80FD;&#x95F4;&#x6B47;&#x6216;&#x6C38;&#x4E45;&#x5730;&#x5931;&#x6548;&#xFF1B;</li>
</ul>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x5199;&#x6210;&#x4E00;&#x4E8C;&#x4E09;&#x6761;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4E0A;&#x8FF0;&#x4E09;&#x6761;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x770B;&#x6765;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x9009;&#x62E9;&#x5E94;&#x8BE5;&#x4F1A;&#x662F;&#x201C;&#x6B63;&#x5E38;&#x901A;&#x4FE1;&#x201D;&#x3002;&#x6BD5;&#x7ADF;&#x7FFB;&#x5899;&#x5DE5;&#x5177;&#x8BDE;&#x751F;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x8BA9;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x88AB;&#x5899;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x6BD4;&#x5982; Google &#x88AB;&#x5899;&#x4E86;&#xFF0C;&#x6211;&#x67B6;&#x8BBE;&#x4E00;&#x4E2A; Shadowsocks &#x670D;&#x52A1;&#x5668;&#x5C31;&#x53C8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; Google &#x3002;&#x81F3;&#x4E8E;&#x6211;&#x5728; Google &#x4E0A;&#x641C;&#x7D22;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x4EBA;&#x755C;&#x65E0;&#x5BB3;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x60F3;&#x522B;&#x4EBA;&#x4E5F;&#x6CA1;&#x5174;&#x8DA3;&#x77E5;&#x9053;&#x3002;&#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x80FD;&#x8BA9;&#x6211;&#x723D;&#x5FEB;&#x5730;&#x8BBF;&#x95EE; Google&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x901F;&#x5EA6;&#x4F18;&#x5148;&#x201D;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x5C31;&#x6BD4;&#x8F83;&#x6CE8;&#x91CD;&#x79C1;&#x5BC6;&#x6027;&#xFF0C;&#x4E0D;&#x7BA1;&#x6211;&#x5728;&#x641C;&#x7D22;&#x4E00;&#x4E9B;&#x4EC0;&#x4E48;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x7F51;&#x7EA2;&#x516B;&#x5366;&#xFF0C;&#x4F46;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x60F3;&#x8BA9;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x88AB;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x4E86;&#x6211;&#x5C31;&#x4E0D;&#x723D;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x9690;&#x79C1;&#x4F18;&#x5148;&#x201D;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4EBA;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x6709;&#x9700;&#x6C42;&#xFF0C;&#x5E73;&#x65F6;&#x6211;&#x4E0D;&#x600E;&#x4E48;&#x7FFB;&#x5899;&#xFF0C;&#x800C;&#x4E00;&#x65E6;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x8981;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x7FFB;&#x51FA;&#x53BB;&#x3002;&#x51E0;&#x767E;&#x4E07;&#x7684;&#x5927;&#x5355;&#xFF0C;&#x8C08;&#x4E0D;&#x6210;&#x8FD9;&#x4E2A;&#x6708;&#x5C31;&#x8981;&#x559D;&#x897F;&#x5317;&#x98CE;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x4EBA;&#x5BF9;&#x7FFB;&#x5899;&#x670D;&#x52A1;&#xFF08;&#x6216;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;&#x670D;&#x52A1;&#x4E0D;&#x80FD;&#x65AD;&#x7EBF;&#x3002;&#x800C;&#x65AD;&#x7EBF;&#x7684;&#x60C5;&#x51B5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x6BD4;&#x5982;&#x7FFB;&#x5899;&#x534F;&#x8BAE;&#x88AB;&#x8BC6;&#x522B;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x63A2;&#x6D4B;&#x4E86;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x9020;&#x6210;&#x7FFB;&#x5899;&#x670D;&#x52A1;&#x5931;&#x6548;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x7A33;&#x5B9A;&#x4F18;&#x5148;&#x201D;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x7684;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x7FFB;&#x5899;&#x5DE5;&#x5177;&#x4E2D;&#x90FD;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x901F;&#x5EA6;&#x4F18;&#x5148;&#x201D;&#x53EF;&#x80FD;&#x7684;&#x95EE;&#x9898;&#x662F; ISP &#x7684; QoS &#x9650;&#x5236;&#xFF0C;&#x5E94;&#x5BF9;&#x65B9;&#x5F0F;&#x662F;&#x6D41;&#x91CF;&#x6DF7;&#x6DC6;&#x3002;&#x53C8;&#x6BD4;&#x5982;&#x201C;&#x9690;&#x79C1;&#x4F18;&#x5148;&#x201D;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x5B8C;&#x7F8E;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#x3002;&#x800C;&#x201C;&#x7A33;&#x5B9A;&#x4F18;&#x5148;&#x201D;&#x9700;&#x8981;&#x7FFB;&#x5899;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x88AB;&#x63A2;&#x6D4B;&#xFF0C;&#x7FFB;&#x5899;&#x534F;&#x8BAE;&#x9700;&#x8981;&#x51CF;&#x5C11;&#x7279;&#x5F81;&#x3002;&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7EB7;&#x7E41;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5F15;&#x8D77;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x89C2;&#x4F17;&#x4E0D;&#x660E;&#x5C31;&#x91CC;&#xFF0C;&#x800C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5219;&#x5FD9;&#x4E8E;&#x63A8;&#x9500;&#x81EA;&#x5DF1;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x5462;&#xFF0C;&#x5C31;&#x8D8A;&#x8BA8;&#x8BBA;&#x8D8A;&#x770B;&#x4E0D;&#x61C2;&#x4E86;&#x3002;</p>
<p>&#x4ECE; V2Ray &#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x8C03;&#x548C;&#x7684;&#x77DB;&#x76FE;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#x4E0D;&#x540C;&#xFF0C;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;&#x4E0D;&#x80FD;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x89C9;&#x5F97;&#x4E00;&#x9879;&#x529F;&#x80FD;&#x597D;&#xFF0C;&#x5C31;&#x5F3A;&#x52A0;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x7528;&#x6237;&#x7528;&#x7740;&#x6CA1;&#x6548;&#x679C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x611F;&#x8C22;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;Shadowsocks &#x6700;&#x8FD1;&#x7684;&#x4E00;&#x6B21;&#x534F;&#x8BAE;&#x5347;&#x7EA7;&#xFF0C;&#x4F7F;&#x7528; AEAD &#x7B97;&#x6CD5;&#x53D6;&#x4EE3;&#x4E86; OTA&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x52A0;&#x5BC6;&#x7279;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x5347;&#x7EA7;&#x5728;&#x201C;&#x901F;&#x5EA6;&#x4F18;&#x5148;&#x201D;&#x7684;&#x7528;&#x6237;&#x770B;&#x6765;&#x662F;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x56E0;&#x4E3A; AEAD &#x53EA;&#x662F;&#x52A0;&#x5F3A;&#x4E86;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E; QoS &#x548C;&#x53EF;&#x88AB;&#x63A2;&#x6D4B;&#x6027;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x8FDB;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x5BA2;&#x89C2;&#x73AF;&#x5883;&#x4E0D;&#x53D8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5347;&#x7EA7;&#x5230; AEAD &#x4E0D;&#x4F1A;&#x5728;&#x7FFB;&#x5899;&#x901F;&#x5EA6;&#x4E0A;&#x6709;&#x4EFB;&#x4F55;&#x63D0;&#x5347;&#x3002;&#x4E8E;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x4F1A;&#x95EE;&#xFF0C;&#x5230;&#x5E95;&#x8981;&#x4E0D;&#x8981;&#x5347;&#x7EA7; AEAD&#xFF0C;&#x5347;&#x5B8C;&#x5BF9;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#x3002;&#x7531;&#x4E8E;&#x60F0;&#x6027;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x4F18;&#x52BF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;AEAD &#x7684;&#x63A8;&#x5E7F;&#x6709;&#x7740;&#x5F88;&#x5927;&#x7684;&#x963B;&#x529B;&#x3002;</p>
<p>V2Ray &#x5219;&#x5C1D;&#x8BD5;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x81EA;&#x7531;&#x7EC4;&#x5408;&#x3002;&#x867D;&#x7136;&#x5404;&#x79CD;&#x7EC4;&#x5408;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x603B;&#x6BD4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x6765;&#x5F97;&#x597D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E0A;&#x8FF0;&#x7684;&#x4E09;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;V2Ray &#x5206;&#x522B;&#x63D0;&#x4F9B;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x901F;&#x5EA6;&#x4F18;&#x5148;&#xFF1A;VMess &#x534F;&#x8BAE;&#x3001;mKCP &#x534F;&#x8BAE;&#x3001;Mux.Cool &#x534F;&#x8BAE;&#xFF0C;&#x5185;&#x90E8;&#x8DEF;&#x7531;&#x5206;&#x6D41;</li>
<li>&#x9690;&#x79C1;&#x4F18;&#x5148;&#xFF1A;TLS (&#x5B8C;&#x6574;&#x5B9E;&#x73B0;&#xFF0C;&#x975E;&#x4F2A;&#x88C5;)</li>
<li>&#x7A33;&#x5B9A;&#x4F18;&#x5148;&#xFF1A;HTTP &#x4F2A;&#x88C5;&#x3001;BT &#x4F2A;&#x88C5;&#x7B49;&#xFF0C;&#x4EE5;&#x53CA; Mux.Cool &#x534F;&#x8BAE;&#x3002;</li>
</ul>
<p>V2Ray &#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#x5DF2;&#x8003;&#x8651;&#x5230;&#x591A;&#x4E2A;&#x529F;&#x80FD;&#x76F8;&#x4E92;&#x7EC4;&#x5408;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; VMess + TLS &#x6765;&#x8FBE;&#x5230;&#x9690;&#x79C1;&#x548C;&#x901F;&#x5EA6;&#x7684;&#x53CC;&#x91CD;&#x4FDD;&#x8BC1;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528; VMess + Mux &#x6765;&#x63D0;&#x5347;&#x901F;&#x5EA6;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x4E5F;&#x8003;&#x8651;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x4E0D;&#x540C;&#xFF0C;V2Ray &#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x90FD;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6253;&#x5F00;&#x6216;&#x5173;&#x95ED;&#xFF0C;&#x4E0D;&#x4F1A;&#x628A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5F3A;&#x52A0;&#x7ED9;&#x7528;&#x6237;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x5728; V2Ray &#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x5E94;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x5F53;&#x7136; V2Ray &#x7684;&#x529F;&#x80FD;&#x8FDC;&#x4E0D;&#x6B62;&#x4E0A;&#x8FF0;&#x8FD9;&#x4E9B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x7684;&#x7FFB;&#x5899;&#x5DE5;&#x5177;&#x5DF2;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x65E5;&#x5E38;&#x9700;&#x6C42;&#xFF0C;&#x4F55;&#x4E0D;&#x8BD5;&#x4E00;&#x4E0B;&#x65B0;&#x7684;&#x8F6E;&#x5B50;&#x5462;&#xFF1F;</p>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="speed.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 传说中的性能测试">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"适合自己的才是最好的","level":"1.2.3","depth":2,"previous":{"title":"传说中的性能测试","level":"1.2.2","depth":2,"path":"2017/speed.md","ref":"2017/speed.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-fontsettings","disqus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"v2ray"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh","gitbook":"*"},"file":{"path":"2017/design.md","mtime":"2017-04-12T09:19:47.133Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-04-12T09:21:02.380Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    </body>
</html>

